In [1]:
import pandas as pd
import numpy as  np

# [실습] titanic 승객 데이터 활용
# 컬럼 설명

# PassengerId - 승객 고유번호
# Survived - 생존유무(target 값) (0 = 사망, 1 = 생존)
# Pclass - 티켓 클래스 (1 = 1st, 2 = 2nd, 3 = 3rd)
# Name - 탑승객 성명
# Sex - 성별 (male: 남성, female: 여성)
# Age - 나이(세)
# SibSp - 함께 탑승한 형제자매, 배우자 수 총합
# Parch - 함께 탑승한 부모, 자녀 수 총합
# Ticket - 티켓 넘버
# Fare - 탑승 요금
# Cabin - 객실 넘버
# Embarked - 탑승 항구 (C: Cherbourg, Q: Queenstown, S: Southampton)
# # titanic.csv 파일 로드
# # titanic 데이터셋의 메타 데이터 확인

titanic = pd.read_csv('./data/titanic.csv')
display(titanic)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# 기초문제

In [2]:
#  1. 전체 승객 중 생존자의 수와 사망자의 수를 구하여 출력

total_survivor = titanic[titanic["Survived"] == 1]
total_death = titanic[titanic["Survived"] == 0]


print(total_survivor.value_counts("Survived"))
print(">----------------------------------------------------------<")
print(total_death.value_counts("Survived"))

Survived
1    342
Name: count, dtype: int64
>----------------------------------------------------------<
Survived
0    549
Name: count, dtype: int64

In [3]:
#  2. 승객 나이의 평균 출력

total_age_sum = titanic["Age"].sum()
total_passenger = titanic["PassengerId"].max()
mean_age = total_age_sum / total_passenger
print(mean_age)

23.79929292929293

In [4]:
#  3. 1등급 승객 중 운임이 가장 높은 승객의 이름 출력

find_top_fare = titanic["Fare"].max()
find_top_fare_name = titanic[titanic["Fare"] == find_top_fare]["Name"]
print(find_top_fare_name)

258                      Ward, Miss. Anna
679    Cardeza, Mr. Thomas Drake Martinez
737                Lesurer, Mr. Gustave J
Name: Name, dtype: object

In [5]:
#  4. 여성 승객의 수를 구하여 출력

find_female = titanic[titanic["Sex"] == "female"]
print(find_female.value_counts("Sex"))

Sex
female    314
Name: count, dtype: int64

In [6]:
#  5. 운임이 50 이상인 승객의 이름과 운임 출력

find_fare_over_50 = titanic[titanic["Fare"] >= 50]
find_name_fare_over_50 = find_fare_over_50[["Name", "Fare"]]
print(find_name_fare_over_50)

                                                  Name      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   53.1000
6                              McCarthy, Mr. Timothy J   51.8625
27                      Fortune, Mr. Charles Alexander  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208
..                                                 ...       ...
856         Wick, Mrs. George Dennick (Mary Hitchcock)  164.8667
863                  Sage, Miss. Dorothy Edith "Dolly"   69.5500
867               Roebling, Mr. Washington Augustus II   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)   83.1583

[161 rows x 2 columns]

In [7]:
#  6. 나이가 18세 미만인 승객들의 생존율을 계산하여 출력

find_age_under_18 = titanic[titanic["Age"] < 18].count()
find_age_under_18_count = find_age_under_18["PassengerId"]
find_survivor_under_18 = titanic[titanic["Age"] < 18].value_counts("Survived")[1]
survival_rate = find_survivor_under_18 / find_age_under_18_count * 100 
print(survival_rate)

53.98230088495575

In [8]:
#  7. 2등급 객실에 탑승한 승객의 평균 운임을 계산하여 출력

find_pclass_2 = titanic[titanic["Pclass"] == 2]
find_pclass_2_fare = find_pclass_2["Fare"].sum()
find_pclass_2_counts = find_pclass_2.count()
find_pclass_2_count = find_pclass_2_counts["PassengerId"]
average_pclass_2 = find_pclass_2_fare / find_pclass_2_count
print(average_pclass_2)

20.662183152173913

In [9]:
#  8. 승객 중 나이가 가장 많은 사람의 나이와 이름을 출력

find_oldest_passenger = titanic["Age"].max()
find_oldest_name_age = titanic[titanic["Age"] == find_oldest_passenger][["Name", "Age"]]
print(find_oldest_name_age)

                                     Name   Age
630  Barkworth, Mr. Algernon Henry Wilson  80.0

In [10]:
#  9. S 항구에서 탑승한 승객의 수를 출력

find_embarked_s_passenger_count = titanic[titanic["Embarked"] == "S"].count()["PassengerId"]
print(find_embarked_s_passenger_count)

644

In [11]:
#  10. 3등급 객실에 탑승한 남성 승객 중 생존자의 수를 출력

find_pclass_3_male_count = titanic[titanic["Pclass"] == 3].value_counts("Sex")["male"]
find_pclass_3_male_survivor = titanic[titanic["Pclass"] == 3].value_counts("Survived")[1]
pclass_3_survival_rate = find_pclass_3_male_survivor / find_pclass_3_male_count * 100
print(pclass_3_survival_rate)

34.293948126801155

# 고급문제

In [12]:
#  1. 생존자(Survived)와 그렇지 않은 사람들의 `Pclass`(객실 등급)별 평균 나이를 각각 출력

find_survivor = titanic[titanic["Survived"] == 1][["Pclass", "Age"]]
for pclass_num in range(1,4):
    find_survivor_placc_1_total_age = find_survivor.loc[find_survivor['Pclass'] == pclass_num, 'Age'].sum()
    find_survivor_placc_1_total_count = find_survivor.loc[find_survivor['Pclass'] == pclass_num, 'Age'].count()
    pclass_survivor_avg_age = find_survivor_placc_1_total_age / find_survivor_placc_1_total_count
    print(f"{pclass_num}등급 객실의 생존자 나이 평균 : {pclass_survivor_avg_age}")

find_death = titanic[titanic["Survived"] == 0][["Pclass", "Age"]]
for pclass_num in range(1,4):
    find_death_placc_1_total_age = find_death.loc[find_death['Pclass'] == pclass_num, 'Age'].sum()
    find_death_placc_1_total_count = find_death.loc[find_death['Pclass'] == pclass_num, 'Age'].count()
    pclass_death_avg_age = find_death_placc_1_total_age / find_death_placc_1_total_count
    print(f"{pclass_num}등급 객실의 사망자 나이 평균 : {pclass_death_avg_age}")

1등급 객실의 생존자 나이 평균 : 35.36819672131148
2등급 객실의 생존자 나이 평균 : 25.90156626506024
3등급 객실의 생존자 나이 평균 : 20.646117647058823
1등급 객실의 사망자 나이 평균 : 43.6953125
2등급 객실의 사망자 나이 평균 : 33.544444444444444
3등급 객실의 사망자 나이 평균 : 26.555555555555557

In [13]:
#  2. `SibSp`(형제/배우자 수)가 3 이상인 승객들 중에서, `Fare`(운임) 상위 5명의 이름과 나이를 출력

find_sibsp_over_3 = titanic[titanic["SibSp"] >= 3]
find_sibsp_top_5 = find_sibsp_over_3.sort_values(by="Age", ascending=False).head(5)[["Name", "Age"]]
print(find_sibsp_top_5)

                                                  Name   Age
85   Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...  33.0
726        Renouf, Mrs. Peter Henry (Lillian Jefferys)  30.0
341                     Fortune, Miss. Alice Elizabeth  24.0
88                          Fortune, Miss. Mabel Helen  23.0
27                      Fortune, Mr. Charles Alexander  19.0

In [14]:
#  3. 승객 중에서 `Age` 값이 결측치(NaN)인 사람들의 `Embarked`(탑승 항구)별 분포를 출력

find_age_nan_embarked = titanic[titanic["Age"].isna()]
embarked_counts = find_age_nan_embarked['Embarked'].value_counts()

for port in ['C', 'Q', 'S']:
    count = embarked_counts.get(port, 0)
    print(f"{port}: {count}개")

C: 38개
Q: 49개
S: 90개

In [38]:
#  4. 나이가 16세 미만이고, 혼자 탑승한(`SibSp == 0` and `Parch == 0`) 승객의 이름과 성별, 생존 여부를 출력

find_under_16_sibsp_parch_0 = titanic[(titanic["Age"] <= 16) &(titanic['SibSp'] == 0)& (titanic['Parch'] == 0)]

display(find_under_16_sibsp_parch_0)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
138,139,0,3,"Osen, Mr. Olaf Elon",male,16.0,0,0,7534,9.2167,NaN,S
156,157,1,3,"Gilnagh, Miss. Katherine ""Katie""",female,16.0,0,0,35851,7.7333,NaN,Q
208,209,1,3,"Carr, Miss. Helen ""Ellen""",female,16.0,0,0,367231,7.7500,NaN,Q
220,221,1,3,"Sunderland, Mr. Victor Francis",male,16.0,0,0,SOTON/OQ 392089,8.0500,NaN,S
282,283,0,3,"de Pelsmaeker, Mr. Alfons",male,16.0,0,0,345778,9.5000,NaN,S
504,505,1,1,"Maioni, Miss. Roberta",female,16.0,0,0,110152,86.5000,B79,S
574,575,0,3,"Rush, Mr. Alfred George John",male,16.0,0,0,A/4. 20589,8.0500,NaN,S
731,732,0,3,"Hassan, Mr. Houssein G N",male,11.0,0,0,2699,18.7875,NaN,C
764,765,0,3,"Eklund, Mr. Hans Linus",male,16.0,0,0,347074,7.7750,NaN,S
777,778,1,3,"Emanuel, Miss. Virginia Ethel",female,5.0,0,0,364516,12.4750,NaN,S
780,781,1,3,"Ayoub, Miss. Banoura",female,13.0,0,0,2687,7.2292,NaN,C
791,792,0,2,"Gaskell, Mr. Alfred",male,16.0,0,0,239865,26.0000,NaN,S
841,842,0,2,"Mudd, Mr. Thomas Charles",male,16.0,0,0,S.O./P.P. 3,10.5000,NaN,S
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C

In [65]:
#  5. 1등급(Pclass == 1) 객실에 탑승한 승객들 중에서, 운임(Fare)이 평균보다 높은 사람들의 이름과 나이, 운임을 출력

find_pclass_1 = titanic[titanic['Pclass'] == 1]
find_pclass_1_mean = find_pclass_1['Fare'].mean()
find_pclass_1_ober_mean = find_pclass_1[titanic['Fare'] > find_pclass_1_mean][['Name', 'Age', 'Fare']]

display(find_pclass_1_ober_mean)

C:\Users\김준협\AppData\Local\Temp\ipykernel_23252\3710359518.py:5: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  find_pclass_1_ober_mean = find_pclass_1[titanic['Fare'] > find_pclass_1_mean][['Name', 'Age', 'Fare']]

                                                  Name   Age      Fare
27                      Fortune, Mr. Charles Alexander  19.0  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)   NaN  146.5208
88                          Fortune, Miss. Mabel Helen  23.0  263.0000
118                           Baxter, Mr. Quigg Edmond  24.0  247.5208
195                               Lurette, Miss. Elise  58.0  146.5208
..                                                 ...   ...       ...
779  Robert, Mrs. Edward Scott (Elisabeth Walton Mc...  43.0  211.3375
802                Carter, Master. William Thornton II  11.0  120.0000
820  Hays, Mrs. Charles Melville (Clara Jennings Gr...  52.0   93.5000
849       Goldenberg, Mrs. Samuel L (Edwiga Grabowska)   NaN   89.1042
856         Wick, Mrs. George Dennick (Mary Hitchcock)  45.0  164.8667

[66 rows x 3 columns]

In [67]:
#  6. 나이(Age), 객실 등급(Pclass), 운임(Fare) 값에 결측치가 없는 승객들만 대상으로, 각 등급별 평균 운임과 중앙값 운임을 출력

find_not_null = titanic.dropna(subset=['Age', 'Pclass', 'Fare'])
find_mean_median = find_not_null.groupby('Pclass')['Fare'].agg(['mean', 'median'])

display(find_mean_median)

             mean   median
Pclass
1       87.961582  69.3000
2       21.471556  15.0458
3       13.229435   8.0500

In [82]:
#  7. 승객들의 `Embarked` 별 평균 나이를 계산하고, 가장 많은 승객이 탑승한 항구를 기준으로 생존율을 계산하여 출력

find_embarked_avg_age = titanic.groupby('Embarked')['Age'].mean()
find_most_embarked = titanic['Embarked'].mode()[0]
survival_rate_embarked = titanic[titanic['Embarked'] == find_most_embarked]['Survived'].mean()

print(survival_rate_embarked)

0.33695652173913043

In [85]:
#  8. 승객 중에서 여성(`Sex == 'female'`)이면서 30세 이상인 사람들의 생존율을 계산하여 출력

find_female_over_30 = titanic[(titanic['Sex'] == 'female') & (titanic['Age'] >= 30)]
find_survival_rate_female_over_30 = find_female_over_30['Survived'].mean()

print(find_survival_rate_female_over_30)

0.8070175438596491

In [89]:
#  9. 동반한 형제 또는 배우자 수(`SibSp`)와 부모 또는 자녀 수(`Parch`)의 합이 3 이상인 승객들만을 대상으로, 그들의 생존율을 계산하여 출력

find_sibsp_parch_over_3 = titanic[(titanic['SibSp'] + titanic['Parch']) >= 3]
find_sibsp_parch_over_3_survival_rate = find_sibsp_parch_over_3['Survived'].mean()


print(find_sibsp_parch_over_3_survival_rate)

0.34065934065934067

In [91]:
#  10. `Cabin`(객실 번호) 정보가 있는 승객들만을 대상으로, 그들의 생존율을 객실 등급별로 구분하여 계산하여 출력

find_cabin_has_impo = titanic[titanic['Cabin'].notna()]
find_survival_rate_has_impr = find_cabin_has_impo.groupby('Pclass')['Survived'].mean().reset_index()

display(find_survival_rate_has_impr)

   Pclass  Survived
0       1  0.664773
1       2  0.812500
2       3  0.500000